### Домашнее задание по уроку №5: 

# 1. Создай список из 5 своих любимых фильмов и выведи второй фильм в списке.
# films = ["spidermen", "supermen", "avngers", "inseption", "kokboru"]
# print(films[2])

# 2. Дан список чисел: [10, 20, 30, 40, 50].
# list = [10, 20, 30, 40, 50]
# # Замени число 30 на 99 и выведи обновленный список.
# list[2] = 99
# print(list)
#
# # 3. Создай два списка: ["яблоко", "банан", "апельсин"",] и ["кот "собака", "тигр"].
# fruits = ["яблоко", "банан", "апельсин"]
# animals = ["кот", "собака", "тигр"]
# # Объедини их в один список и выведи результат.
# fa = animals + fruits
# print(fa)
#
# # 4. Есть список [4, 2, 9, 1].
# list = [4, 2, 9, 1]
# # Добавь число 7 в конец списка, затем удали число 2. Выведи итоговый список.
# list.append(7)
# list.remove(2)
# list.sort()
# print(list)
# 5. Дан список ["Python", "Java", "C++", "JavaScript", "PHP"].
# list = ["Python", "Java", "C++", "JavaScript", "PHP"]
# # Выведи первые три элемента списка.
# print(list[:3])
#
# # 6. Дан список имен ["Аня", "Борис", "Вика"].
# names = ["Аня", "Борис", "Вика"]
# # Выведи имя, которое стоит на втором месте.
# print(names[1])
#
# # 7. Дан список чисел [5, 10, 15, 20, 25].
# numb = [5, 10, 15, 20, 25]
# # Выведи список в обратном порядке с помощью среза.
# print(numb[::-1])
# 8. Создай пустой список и добавь в него три числа: 5, 10 и 15.
# num = []
# num.append(5)
# num.append(10)
# num.append(15)
# # print(num)
# # 9. Дан список чисел [10, 15, 20, 25, 30].
# numbers = [10, 15, 20, 25, 30]
# # Выведи первый и последний элементы списка.
# print(numbers[0],numbers[-1])
#
# # 10. Даны два списка: [1, 2, 3] и [4, 5, 6].
# num1 = [1, 2, 3]
# num2 = [4, 5, 6]
# # Объедини их в один список и выведи.
# print(num1 + num2)
# # 11. Дан список чисел [2, 7, 3, 8, 5, 9].
# Найди сумму первых трех элементов списка.

# 12. Дан список строк ["apple", "banana", "cherry", "date"].
# Выведи длину первого слова в списке.

# 13. Дан список [100, 200, 300, 400, 500]. 
# Разверни список и выведи его.

# 14. Дан список чисел [1, 2, 3, 4, 5, 6, 7, 8, 9, 10].
# Создай новый список, содержащий только первые пять чисел.

# 15. Дан список строк ["кот", "собака", "тигр", "лев", "слон"]. 
# Выведи последний элемент списка.

# 16. Создай список из трех чисел. 
# Найди максимальное и минимальное значение, используя встроенные функции max() и min().

# 17. Дан список строк ["яблоко", "банан", "вишня", "дыня"]. 
# Проверь, есть ли в списке слово "груша", и выведи "Есть" или "Нет".

# 18. Дан список [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]. 
# Замени число 4 на строку "четыре".

# 19. Дан список чисел [3, 6, 9, 12, 15]. 
# Умножь число 9 на 2 и выведи новый список.

# 20. Дан двумерный список [[1, 2], [3, 4], [5, 6]]. 
# Выведи число 5, обратившись к нужному индексу.

# 21. Дан список [10, 20, 30, 40, 50].
# Вставь число 25 перед числом 30.

# 22. Дан список строк ["один", "два", "три", "четыре"].
# Преврати первое слово в списке в заглавные буквы.

# 23. Дан список чисел [4, 16, 25, 36].
# Найди квадратный корень первого элемента.

# 24. Дан список [5, 10, 15, 20].
# Найди разность между максимальным и минимальным значением.

# 25. Создай список из 5 имен и отсортируй его в обратном алфавитном порядке.

# 26. Дан список [1, 1, 2, 2, 3, 3, 4, 4].
# Определи, сколько раз встречается число 2.

# 27. Дан список чисел от 1 до 10.
# Создай новый список, содержащий первые три элемента и последние три элемента.

# 28. Дан список строк ["питон", "java", "c++", "javascript"].
# Преобразуй второй элемент в заглавные буквы и выведи.

# 29. Даны два списка одинаковой длины: [1, 2, 3] и [4, 5, 6].
# Создай новый список, состоящий из сложенных попарно элементов двух списков.

# 30. Дан список чисел [10, 20, 30, 40, 50].
# Выведи произведение первого и последнего элементов списка.

# 31. Дан список имен ["Алекс", "Маша", "Олег", "Вика"].
name = ["Алекс", "Маша", "Олег", "Вика"]
# Определи, есть ли в списке имя "Олег".
print("Олег" in name)

# 32. Дан список чисел [3, 6, 9, 12].
# Замени третий элемент списка на 99.

# 33. Дан список строк ["кот", "собака", "тигр"].
# Соедини первый и последний элементы списка в одну строку.

# 34. Дан список чисел [5, -2, 3, -1, 6, -3].
# Определи, есть ли в списке отрицательное число.

# 35. Дан список [10, 20, 30, 40, 50].
# Разбей его на два подсписка: первый с первыми двумя элементами, второй с оставшимися.
numbers = [10, 20, 30, 40, 50]
numb1 = numbers[:2]
numb2 = numbers[2:]
print(numb1, numb2)
# 36. Дан список чисел [1, 2, 3, 4, 5].
# Замени первый элемент на его квадрат.

# 37. Дан список строк ["hello", "world", "python"].
# Создай новый список, содержащий только первое и последнее слова.

# 38. Дан список чисел [12, 5, 8, 15, 30].
# Найди разницу между вторым и третьим элементами.

# 39. Дан список слов ["apple", "banana", "cherry", "date"].
# Выведи второе слово в обратном порядке.

# 40. Дан двумерный список [[2, 4, 6], [1, 3, 5], [8, 10, 12]].
# Выведи первый элемент второго подсписка.
